In [40]:
import pandas as pd
import numpy as np

df=pd.DataFrame(np.arange(9).reshape(3,3),
             index=["a","b","c"],
             columns=["台北","台中","高雄"])

In [41]:
df1=df.reindex(index=["b","a","c"])
df1

   台北  台中  高雄
b   3   4   5
a   0   1   2
c   6   7   8

In [42]:
df2=df.reindex(columns=["台中","台北"])
df1

   台北  台中  高雄
b   3   4   5
a   0   1   2
c   6   7   8

In [43]:
df3=pd.DataFrame(np.arange(16).reshape(4,4),
                 index=["台北","台中","台南","桃園"],
                 columns=["one","two","three","four"])
df3

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
桃園   12   13     14    15

In [44]:
df3.drop(index=["台北","台中"])

    one  two  three  four
台南    8    9     10    11
桃園   12   13     14    15